FKDD_COPY_DIFF_3_2026-02-13/Documents/ОпределениеМинимальногоОстатка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОпределениеМинимальногоОстатка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоМесяцевДляРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РассчитанныйМинимальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстанавливаемыйМинимальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоложительныйМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМесяцев_ГруппаA</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМесяцев_ГруппаB</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлечоДоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховойЗапас</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднедневнойРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаABC</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипXYZ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйОстаток1Уровня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйОстаток2Уровня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйОстаток3Уровня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ВычисляемыеПараметрыДляМинимальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВычисляемыеПараметрыДляМинимальныхОстатков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипXYZ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаABC</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ДополнительныеРеквизитыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДополнительныеРеквизитыНоменклатуры</Name>
			<Comment>Cписок возможных дополнительных реквизитов для номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МинимальныйОстаток</Name>
					<Comment>Минимальный остаток товара на складе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаПотерь</Name>
					<Comment>Норма потерь товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйЗапас</Name>
					<Comment>Количество больше которого нет смысла заказывать товар у поставщика</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентОтходов</Name>
					<Comment>Процент отходов (для заполнения документа "списание")</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвантПоставки</Name>
					<Comment>Кратность формирования заказов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Documents/ОпределениеМинимальногоОстатка/Ext/ObjectModule.bsl
Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Дата <= Дата(2019, 07, 15) тогда
		сообщить("Ранее 15 июля 2019 года проводить нельзя!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Для каждого СтрокаДокумента из Товары цикл
		Если СтрокаДокумента.УстанавливаемыйМинимальныйОстаток <> СтрокаДокумента.РассчитанныйМинимальныйОстаток И СтрокаДокумента.Комментарий = "" тогда
			сообщить("В строке №" + СтрокаДокумента.НомерСтроки + " обязательно нужно указать причину изменения минимального остатка! Заполните колонку Комментарий для этой строки! ");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	
	Для каждого СтрокаДокумента из Товары цикл
		Если (СтрокаДокумента.ТипXYZ = "") Тогда 
			сообщить("ТИП XYZ по номенклатуре " + СтрокаДокумента.Номенклатура + " не рассчитан!!! Необходимо произвести расчет документа автоматически! ");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Если (СтрокаДокумента.ГруппаABC = "")  Тогда
			сообщить("Группа ABC по номенклатуре " + СтрокаДокумента.Номенклатура + " не рассчитана!!! Необходимо произвести расчет документа автоматически! ");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	НаборЗаписей = РегистрыСведений.ДополнительныеРеквизитыНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПодразделениеКомпании.Установить(ПодразделениеКомпании);
	НаборЗаписей.Отбор.ДополнительныйРеквизит.Установить(Перечисления.ДополнительныеРеквизитыНоменклатуры.МинимальныйОстаток);
	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Записать();
	
	Для Каждого СтрокаТаблицы Из Товары Цикл 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.Номенклатура = СтрокаТаблицы.Номенклатура; 
		НоваяЗапись.ПодразделениеКомпании = ПодразделениеКомпании; 
		НоваяЗапись.ДополнительныйРеквизит = Перечисления.ДополнительныеРеквизитыНоменклатуры.МинимальныйОстаток; 
		НоваяЗапись.Период = Дата; 
		НоваяЗапись.ЗначениеРеквизита = СтрокаТаблицы.УстанавливаемыйМинимальныйОстаток; 
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();

	
	НаборЗаписей = РегистрыСведений.ВычисляемыеПараметрыДляМинимальныхОстатков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Записать();
	
	
	Для Каждого СтрокаТаблицы Из Товары Цикл 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Номенклатура = СтрокаТаблицы.Номенклатура; 
		НоваяЗапись.Период = Дата; 
		НоваяЗапись.ГруппаABC = СтрокаТаблицы.ГруппаABC; 
		НоваяЗапись.ТипXYZ = СтрокаТаблицы.ТипXYZ; 
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) Экспорт
	
		НаборЗаписей = РегистрыСведений.ДополнительныеРеквизитыНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПодразделениеКомпании.Установить(ПодразделениеКомпании);
		НаборЗаписей.Отбор.ДополнительныйРеквизит.Установить(Перечисления.ДополнительныеРеквизитыНоменклатуры.МинимальныйОстаток);
		НаборЗаписей.Отбор.Период.Установить(Дата);
		НаборЗаписей.Записать();

		НаборЗаписей = РегистрыСведений.ВычисляемыеПараметрыДляМинимальныхОстатков.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Дата);
		НаборЗаписей.Записать();

КонецПроцедуры

//&НаСервере
//Процедура ТабличныйДокументФормирование(ТабДокумент, ЭтотОбъект)
//Пробный.ТабличныйДокумент_Формирование(ТабДокумент, ЭтотОбъект);	
//КонецПроцедуры

//&НаСервере
//Процедура Печать(Кнопка) Экспорт
//////	Макет = ПолучитьМакет("Макет");
//////	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
//	ТабДокумент = Новый ТабличныйДокумент();

//////	ОбластьМакета.Параметры.Дата = Дата; 
//////	ОбластьМакета.Параметры.Год_ДоТекущегоМесяца = ФОРМАТ(НачалоМесяца(ДобавитьМесяц(Дата, -ЧислоМесяцевДляРасчета)), "ДЛФ") + " - " + Формат(КонецМесяца(ДобавитьМесяц(Дата, -1)), "ДЛФ");
//////	ТабДокумент.Вывести(ОбластьМакета);	
//////	
//////	//перебор строк
//////	ОбластьМакета = Макет.ПолучитьОбласть("Строка|Таблица");
//////	//ТаблицаТолькоНеликвид = Неликвид();
//////	Для Каждого СтрокаТабл Из Товары Цикл
//////	//	ЦветСтроки = ЭлементыФормы.Товары.ОформлениеСтроки(СтрокаТабл).ЦветФона;
//////		ОбластьМакета.Параметры.Заполнить(СтрокаТабл);
//////	//	ОбластьМакета.Области.Строка.ЦветФона = ЦветСтроки;
//////		ТабДокумент.Вывести(ОбластьМакета);
////////		сообщить("строка макета №" + СтрокаТабл.НомерСтроки);



//////		//СтрокаТаблНеликвид = ТаблицаТолькоНеликвид.Найти(СтрокаТабл.Номенклатура, "Номенклатура");
//////		//
//////		//Если СтрокаТаблНеликвид<>Неопределено тогда
//////		//	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаНеликвид");
//////		//Иначе
//////		//	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
//////		//КонецЕсли;
//////		//ОбластьМакета.Параметры.Заполнить(СтрокаТабл);
//////		//ТабДокумент.Вывести(ОбластьМакета);
//////	КонецЦикла;
//////	
//ТабличныйДокументФормирование(ТабДокумент, ЭтотОбъект);
//ТабДокумент.Показать();
//	
//КонецПроцедуры

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли
